test_result/fio-3.28-4R5J0001-rw-1G-qd64-num1-64K-3000-WT.txt
fio: Any use of blockalign= turns off randommap
fio-3.28-4R5J0001-randwrite-1G-64-1-64K: (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685764,
  "timestamp_ms" : 1750685764924,
  "time" : "Mon Jun 23 21:36:04 2025",
  "global options" : {
    "ba" : "192K"
  },
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-randwrite-1G-64-1-64K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-randwrite-1G-64-1-64K",
        "filename" : "/dev/sda",
        "rw" : "randwrite",
        "bs" : "64K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "64",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "write" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 1101273665,
        "bw" : 1075462,
        "iops" : 16804.102564,
        "runtime" : 975,
        "total_ios" : 16384,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 5171,
          "max" : 61409,
          "mean" : 18923.065369,
          "stddev" : 10659.745520,
          "N" : 16384
        },
        "clat_ns" : {
          "min" : 551814,
          "max" : 17473315,
          "mean" : 3784160.072205,
          "stddev" : 769539.510461,
          "N" : 16384,
          "percentile" : {
            "1.000000" : 3424256,
            "5.000000" : 3522560,
            "10.000000" : 3555328,
            "20.000000" : 3620864,
            "30.000000" : 3653632,
            "40.000000" : 3686400,
            "50.000000" : 3719168,
            "60.000000" : 3719168,
            "70.000000" : 3751936,
            "80.000000" : 3784704,
            "90.000000" : 3850240,
            "95.000000" : 3915776,
            "99.000000" : 7241728,
            "99.500000" : 10158080,
            "99.900000" : 14090240,
            "99.950000" : 14614528,
            "99.990000" : 17170432
          },
          "bins" : {
            "552960" : 1,
            "561152" : 8,
            "765952" : 1,
            "782336" : 1,
            "897024" : 1,
            "921600" : 1,
            "929792" : 2,
            "1056768" : 1,
            "1089536" : 2,
            "1204224" : 1,
            "1236992" : 1,
            "1269760" : 1,
            "1302528" : 1,
            "1368064" : 2,
            "1466368" : 2,
            "1548288" : 2,
            "1564672" : 1,
            "1695744" : 2,
            "1794048" : 1,
            "1810432" : 1,
            "1908736" : 2,
            "2007040" : 2,
            "2113536" : 2,
            "2146304" : 2,
            "2179072" : 1,
            "2310144" : 2,
            "2539520" : 1,
            "2572288" : 2,
            "2670592" : 1,
            "2703360" : 3,
            "2801664" : 2,
            "2867200" : 1,
            "3031040" : 4,
            "3162112" : 2,
            "3293184" : 2,
            "3325952" : 13,
            "3358720" : 25,
            "3391488" : 44,
            "3424256" : 101,
            "3457024" : 166,
            "3489792" : 318,
            "3522560" : 504,
            "3555328" : 788,
            "3588096" : 1171,
            "3620864" : 1410,
            "3653632" : 1717,
            "3686400" : 1663,
            "3719168" : 1890,
            "3751936" : 1757,
            "3784704" : 1489,
            "3817472" : 1060,
            "3850240" : 751,
            "3883008" : 502,
            "3915776" : 262,
            "3948544" : 107,
            "3981312" : 48,
            "4014080" : 26,
            "4046848" : 10,
            "4079616" : 21,
            "4112384" : 14,
            "4145152" : 13,
            "4177920" : 9,
            "4227072" : 28,
            "4292608" : 30,
            "4358144" : 39,
            "4423680" : 36,
            "4489216" : 9,
            "4554752" : 17,
            "4620288" : 11,
            "4685824" : 8,
            "4751360" : 1,
            "4816896" : 10,
            "4882432" : 10,
            "5013504" : 4,
            "5079040" : 1,
            "5275648" : 3,
            "5341184" : 1,
            "5472256" : 2,
            "5603328" : 3,
            "5799936" : 3,
            "5865472" : 1,
            "5996544" : 2,
            "6127616" : 2,
            "6193152" : 4,
            "6455296" : 2,
            "6520832" : 4,
            "6782976" : 3,
            "6848512" : 2,
            "6979584" : 3,
            "7045120" : 3,
            "7110656" : 11,
            "7176192" : 13,
            "7241728" : 14,
            "7307264" : 10,
            "7372800" : 7,
            "7438336" : 2,
            "7503872" : 1,
            "7569408" : 1,
            "7634944" : 1,
            "7700480" : 1,
            "7831552" : 5,
            "7897088" : 2,
            "7962624" : 1,
            "8093696" : 1,
            "8159232" : 6,
            "8224768" : 2,
            "8290304" : 2,
            "8355840" : 1,
            "8454144" : 1,
            "8585216" : 1,
            "8716288" : 4,
            "8847360" : 4,
            "8978432" : 1,
            "9109504" : 3,
            "9240576" : 3,
            "9371648" : 3,
            "9502720" : 2,
            "9633792" : 1,
            "9764864" : 4,
            "9895936" : 2,
            "10027008" : 9,
            "10158080" : 2,
            "10289152" : 3,
            "10420224" : 4,
            "10551296" : 1,
            "10682368" : 2,
            "10813440" : 3,
            "10944512" : 2,
            "11075584" : 3,
            "11206656" : 4,
            "11337728" : 3,
            "11468800" : 2,
            "11599872" : 4,
            "11730944" : 2,
            "11862016" : 1,
            "11993088" : 4,
            "12255232" : 3,
            "12386304" : 2,
            "12517376" : 2,
            "12648448" : 6,
            "12779520" : 2,
            "12910592" : 1,
            "13172736" : 2,
            "13697024" : 4,
            "13828096" : 1,
            "13959168" : 1,
            "14090240" : 4,
            "14221312" : 2,
            "14352384" : 1,
            "14483456" : 2,
            "14614528" : 1,
            "14745600" : 2,
            "15007744" : 1,
            "15794176" : 1,
            "16318464" : 1,
            "16449536" : 1,
            "17170432" : 1,
            "17432576" : 1
          }
        },
        "lat_ns" : {
          "min" : 567161,
          "max" : 17491715,
          "mean" : 3803421.842590,
          "stddev" : 769071.319947,
          "N" : 16384
        },
        "bw_min" : 1080064,
        "bw_max" : 1080064,
        "bw_agg" : 100.000000,
        "bw_mean" : 1080064.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 1,
        "iops_min" : 16876,
        "iops_max" : 16876,
        "iops_mean" : 16876.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 1
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 974,
      "usr_cpu" : 12.936345,
      "sys_cpu" : 31.519507,
      "ctx" : 5224,
      "majf" : 0,
      "minf" : 10,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.195312,
        ">=64" : 99.615479
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.993873,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.100000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.054932,
        "1000" : 0.036621
      },
      "latency_ms" : {
        "2" : 0.122070,
        "4" : 96.520996,
        "10" : 2.728271,
        "20" : 0.537109,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 64,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 46,
      "write_ios" : 14755,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 4,
      "write_ticks" : 55151,
      "in_queue" : 55155,
      "util" : 90.519878
    }
  ]
}

fio-3.28-4R5J0001-randwrite-1G-64-1-64K: (groupid=0, jobs=1): err= 0: pid=80943: Mon Jun 23 21:36:04 2025
  write: IOPS=16.8k, BW=1050MiB/s (1101MB/s)(1024MiB/975msec); 0 zone resets
    slat (nsec): min=5171, max=61409, avg=18923.07, stdev=10659.75
    clat (usec): min=551, max=17473, avg=3784.16, stdev=769.54
     lat (usec): min=567, max=17491, avg=3803.42, stdev=769.07
    clat percentiles (usec):
     |  1.00th=[ 3425],  5.00th=[ 3523], 10.00th=[ 3556], 20.00th=[ 3621],
     | 30.00th=[ 3654], 40.00th=[ 3687], 50.00th=[ 3720], 60.00th=[ 3720],
     | 70.00th=[ 3752], 80.00th=[ 3785], 90.00th=[ 3851], 95.00th=[ 3916],
     | 99.00th=[ 7242], 99.50th=[10159], 99.90th=[14091], 99.95th=[14615],
     | 99.99th=[17171]
   bw (  MiB/s): min= 1054, max= 1054, per=100.00%, avg=1054.75, stdev= 0.00, samples=1
   iops        : min=16876, max=16876, avg=16876.00, stdev= 0.00, samples=1
  lat (usec)   : 750=0.05%, 1000=0.04%
  lat (msec)   : 2=0.12%, 4=96.52%, 10=2.73%, 20=0.54%
  cpu          : usr=12.94%, sys=31.52%, ctx=5224, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=1050MiB/s (1101MB/s), 1050MiB/s-1050MiB/s (1101MB/s-1101MB/s), io=1024MiB (1074MB), run=975-975msec

Disk stats (read/write):
  sda: ios=46/14755, merge=0/0, ticks=4/55151, in_queue=55155, util=90.52%